tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/services"
tap "leoafarias/fvm"

brew "colima", restart_service: true
brew "docker"
brew "docker-buildx"
brew "volta"
brew "leoafarias/fvm/fvm"

# cask "discord"
# cask "google-chrome"
cask "kitty"
cask "visual-studio-code"
cask "xquartz"

vscode "Compulim.vscode-clock"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "yzane.markdown-pdf"
