tap "dart-lang/dart"
tap "dimentium/autoraise"
tap "homebrew/bundle"
tap "homebrew/services"
tap "leoafarias/fvm"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Linux virtual machines
brew "lima"

# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: true

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# Pack, ship and run any application as a lightweight container
brew "docker"

# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"

brew "docker-compose"

# Modern, maintained replacement for ls
brew "eza"

# Prevents you from committing sensitive information to a git repo
brew "git-secrets"

# Fast, configurable, shell plugin manager
brew "sheldon"

# Cross-shell prompt for astronauts
brew "starship"

# JavaScript toolchain manager for reproducible environments
brew "volta"

# Focus-follows-mouse for MacOS
brew "dimentium/autoraise/autoraise"

# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"

brew "direnv"

# Voice and text chat software
cask "discord"

cask "slack"

# GPU-based terminal emulator
cask "kitty"

# Open-source code editor
cask "visual-studio-code"

# Open-source version of the X.Org X Window System
cask "xquartz"

# Clipboard manager
cask "clibor"

cask "raycast"

cask "android-studio"

cask "postman"

# cask "google-chrome"

vscode "alireza94.theme-gotham"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.path-intellisense"
vscode "compulim.vscode-clock"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
